## Naive Bayes Classification Algorithm Implementation

In [49]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

# from sklearn.naive_bayes import  
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score,auc,roc_auc_score

In [19]:
data = pd.read_csv("titanic.csv")

In [20]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Data Cleaning

In [21]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
# Remove unncessary column

data.drop(['PassengerId','Name','SibSp','Parch', 'Ticket','Cabin', 'Embarked'],axis=1,inplace=True)

In [23]:
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [25]:
X = pd.get_dummies(data,columns=['Sex'],drop_first=True)

In [26]:
X.head()

   Survived  Pclass   Age     Fare  Sex_male
0         0       3  22.0   7.2500         1
1         1       1  38.0  71.2833         0
2         1       3  26.0   7.9250         0
3         1       1  35.0  53.1000         0
4         0       3  35.0   8.0500         1

In [27]:
y = data['Survived']

In [28]:
# Check missing values

X.isna().sum()

Survived      0
Pclass        0
Age         177
Fare          0
Sex_male      0
dtype: int64

In [29]:
X['Age'] =  X.Age.fillna(X.Age.mean())

In [30]:
X.isna().sum()

Survived    0
Pclass      0
Age         0
Fare        0
Sex_male    0
dtype: int64

### Train and Test Split

In [42]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2)

### Model Training

In [43]:
model = GaussianNB()

In [44]:
model.fit(X_train,y_train)

GaussianNB()

In [45]:
y_pred = model.predict(X_test)

In [46]:
accuracy_score(y_test,y_pred)

1.0

In [47]:
model.score(X_test,y_test)

1.0

In [50]:
roc_auc_score(y_test,y_pred)

1.0

The model is overfitting so we'll check later.